cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
						</field>
						<field>
							<name>ABEOINTCLR</name>
							<description>End of auto-baud interrupt clear bit (write only accessible).</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_IMPACT</name>
									<description>Writing a 0 has no impact.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABTOINTCLR</name>
							<description>Auto-baud time-out interrupt clear bit (write only accessible).</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_IMPACT</name>
									<description>Writing a 0 has no impact.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:10]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>IrDA Control Register. Enables and configures the IrDA (remote control) mode.</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IRDAEN</name>
							<description>IrDA mode enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IRDA_MODE_IS_DISABLE</name>
									<description>IrDA mode is disabled, USARTn acts as a standard USART.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRDA_MODE_IS_ENABLED</name>
									<description>IrDA mode is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRDAINV</name>
							<description>Serial input inverter</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INVERTED</name>
									<description>The serial input is not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_INVERTED</name>
									<description>The serial input is inverted. This has no effect on the serial output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIXPULSEEN</name>
							<description>IrDA fixed pulse width mode.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>IrDA fixed pulse width mode disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>IrDA fixed pulse width mode enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSEDIV</name>
							<description>Configures the pulse width when FixPulseEn = 1.</description>
							<bitRange>[5:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>3_DIV_16_X_BAUD_RATE</name>
									<description>3 / (16 x baud rate)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_X_TPCLK</name>
									<description>2 x TPCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_X_TPCLK</name>
									<description>4 x TPCLK</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_X_TPCLK</name>
									<description>8 x TPCLK</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_X_TPCLK</name>
									<description>16 x TPCLK</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_X_TPCLK</name>
									<description>32 x TPCLK</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64_X_TPCLK</name>
									<description>64 x TPCLK</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128_X_TPCLK</name>
									<description>128 x TPCLK</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVADDVAL</name>
							<description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the USART baud rate.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>MULVAL</name>
							<description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for USART to operate properly, regardless of whether the fractional baud rate generator is used or not.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>OSR</name>
					<description>Oversampling Register. Controls the degree of oversampling during each bit time.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0xF0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>OSFRAC</name>
							<description>Fractional part of the oversampling ratio, in units of 1/8th of an input clock period. (001 = 0.125, ..., 111 = 0.875)</description>
							<bitRange>[3:1]</bitRange>
						</field>
						<field>
							<name>OSINT</name>
							<description>Integer part of the oversampling ratio, minus 1. The reset values equate to the normal operating mode of 16 input clocks per bit time.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>FDINT</name>
							<description>In Smart Card mode, these bits act as a more-significant extension of the OSint field, allowing an oversampling ratio up to 2048 as required by ISO7816-3. In Smart Card mode, bits 14:4 should initially be set to 371, yielding an oversampling ratio of 372.</description>
							<bitRange>[14:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TER</name>
					<description>Transmit Enable Register. Turns off USART transmitter for use with software flow control.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x80</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[6:0]</bitRange>
						</field>
						<field>
							<name>TXEN</name>
							<description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it detects that the a hardware-handshaking TX-permit signal (CTS) has gone false, or with software handshaking, when it receives an XOFF character (DC3). Software can set this bit again when it detects that the TX-permit signal has gone true, or when it receives an XON (DC1) character.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HDEN</name>
					<description>Half duplex enable register.</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HDEN</name>
							<description>Half-duplex mode enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_HALF_DUPLEX_</name>
									<description>Disable half-duplex mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_HALF_DUPLEX_M</name>
									<description>Enable half-duplex mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>

