cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SCICTRL</name>
					<description>Smart Card Interface Control register. Enables and configures the Smart Card Interface feature.</description>
					<addressOffset>0x048</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCIEN</name>
							<description>Smart Card Interface Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SMART_CARD_INTERFACE</name>
									<description>Smart card interface disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ASYNCHRONOUS_HALF_DU</name>
									<description>Asynchronous half duplex smart card interface is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NACKDIS</name>
							<description>NACK response disable. Only applicable in T=0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A NACK response is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>A NACK response is inhibited.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTSEL</name>
							<description>Protocol selection as defined in the ISO7816-3 standard.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>T_EQ_0</name>
									<description>T = 0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T_EQ_1</name>
									<description>T = 1</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[4:3]</bitRange>

						</field>
						<field>
							<name>TXRETRY</name>
							<description>When the protocol selection T bit (above) is 0, the field controls the maximum number of retransmissions that the USART will attempt if the remote device signals NACK. When NACK has occurred this number of times plus one, the Tx Error bit in the LSR is set, an interrupt is requested if enabled, and the USART is locked until the FIFO is cleared.</description>
							<bitRange>[7:5]</bitRange>

						</field>
						<field>
							<name>XTRAGUARD</name>
							<description>When the protocol selection T bit (above) is 0, this field indicates the number of bit times (ETUs) by which the guard time after a character transmitted by the USART should exceed the nominal 2 bit times. 0xFF in this field may indicate that there is just a single bit after a character and 11 bit times/character</description>
							<bitRange>[15:8]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:16]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>RS485CTRL</name>
					<description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NMMEN</name>
							<description>NMM enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the USART to set the parity error and generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXDIS</name>
							<description>Receiver enable.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_RECEIVER_IS_ENAB</name>
									<description>The receiver is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_RECEIVER_IS_DISA</name>
									<description>The receiver is disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AADEN</name>
							<description>AAD enable.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_ADDRESS_DETECT_</name>
									<description>Auto Address Detect (AAD) is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_ADDRESS_DETECT_</name>
									<description>Auto Address Detect (AAD) is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Select direction control pin</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RTS</name>
									<description>If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTR</name>
									<description>If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCTRL</name>
							<description>Auto direction control enable.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_AUTO_DIRECTI</name>
									<description>Disable Auto Direction Control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTO_DIRECTIO</name>
									<description>Enable Auto Direction Control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OINV</name>
							<description>Polarity control. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
 
