cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<dim>4</dim>				
		<dimIncrement>0x4</dimIncrement>				
		<dimIndex>0-3</dimIndex>				
		<name>MR%s</name>				
		<description>Match Register 0. MR0 can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR0 matches the TC.</description>				
		<addressOffset>0x018</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>MATCH</name>		
				<description>Timer counter match value.</description>		
				<bitRange>[15:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:16]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>CCR</name>				
		<description>Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.</description>				
		<addressOffset>0x028</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>CAP0RE</name>		
				<description>Capture on CT16B0_CAP0 rising edge: a sequence of 0 then 1 on CT16B0_CAP0 will cause CR0 to be loaded with the contents of TC.</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLED_</name>
						<description>Enabled.</description>
						<value>1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLED_</name>
						<description>Disabled.</description>
						<value>0</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>CAP0FE</name>		
				<description>Capture on CT16B0_CAP0 falling edge: a sequence of 1 then 0 on CT16B0_CAP0 will cause CR0 to be loaded with the contents of TC.</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLED_</name>
						<description>Enabled.</description>
						<value>1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLED_</name>
						<description>Disabled.</description>
						<value>0</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>CAP0I</name>		
				<description>Interrupt on CT16B0_CAP0 event: a CR0 load due to a CT16B0_CAP0 event will generate an interrupt.</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLED_</name>
						<description>Enabled.</description>
						<value>1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLED_</name>
						<description>Disabled.</description>
						<value>0</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[3:3]</bitRange>		
					
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[4:4]</bitRange>		
					
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[5:5]</bitRange>		
					
			</field>			
			<field>			
				<name>CAP1RE</name>		
				<description>Capture on CT16B0_CAP1 rising edge: a sequence of 0 then 1 on CT16B0_CAP1 will cause CR1 to be loaded with the contents of TC. This bit is reserved for 16-bit timer1 CT16B1.</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLED_</name>
						<description>Enabled.</description>
						<value>1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLED_</name>
						<description>Disabled.</description>
						<value>0</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>CAP1FE</name>		
				<description>Capture on CT16B0_CAP1 falling edge: a sequence of 1 then 0 on CT16B0_CAP1 will cause CR1 to be loaded with the contents of TC. This bit is reserved for 16-bit timer1 CT16B1.</description>		
				<bitRange>[7:7]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLED_</name>
						<description>Enabled.</description>
						<value>1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLED_</name>
						<description>Disabled.</description>
						<value>0</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>CAP1I</name>		
				<description>Interrupt on CT16B0_CAP1 event: a CR1 load due to a CT16B0_CAP1 event will generate an interrupt. This bit is reserved for 16-bit timer1 CT16B1.</description>		
				<bitRange>[8:8]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLED_</name>
						<description>Enabled.</description>
						<value>1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLED_</name>
						<description>Disabled.</description>
						<value>0</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>		
				<bitRange>[31:9]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>CR0</name>				
		<description>Capture Register 0. CR0 is loaded with the value of TC when there is an event on the CT16B0_CAP0 input.</description>				
		<addressOffset>0x02C</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>CAP</name>		
				<description>Timer counter capture value.</description>		
				<bitRange>[15:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:16]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>CR1</name>				
		<description>Capture Register 1. CR1 is loaded with the value of TC when there is an event on the CT16B0_CAP1 input.</description>				
		<addressOffset>0x034</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0x00000000</resetMask>				
		<fields>				
			<field>			
				<name>CAP</name>		
				<description>Timer counter capture value.</description>		
				<bitRange>[15:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:16]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>EMR</name>				
		<description>External Match Register. The EMR controls the match function and the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].</description>				
		<addressOffset>0x03C</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>EM0</name>		
				<description>External Match 0. This bit reflects the state of output CT16B0_MAT0/CT16B1_MAT0, whether or not this output is connected to its pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4] control the functionality of this output. This bit is driven to the CT16B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>		
				<bitRange>[0:0]</bitRange>		
					
