cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>TC</name>																					
		<description>Timer Counter. The 32-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.</description>																					
		<addressOffset>0x008</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>TC</name>																			
				<description>Timer counter value.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PR</name>																					
		<description>Prescale Register. When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC.</description>																					
		<addressOffset>0x00C</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PCVAL</name>																			
				<description>Prescaler value.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PC</name>																					
		<description>Prescale Counter. The 32-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface.</description>																					
		<addressOffset>0x010</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PC</name>																			
				<description>Prescale counter value.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>MCR</name>																					
		<description>Match Control Register. The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs.</description>																					
		<addressOffset>0x014</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MR0I</name>																			
				<description>Interrupt on MR0: an interrupt is generated when MR0 matches the value in the TC.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR0R</name>																			
				<description>Reset on MR0: the TC will be reset if MR0 matches it.</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR0S</name>																			
				<description>Stop on MR0: the TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC.</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR1I</name>																			
				<description>Interrupt on MR1: an interrupt is generated when MR1 matches the value in the TC.</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR1R</name>																			
				<description>Reset on MR1: the TC will be reset if MR1 matches it.</description>																			
				<bitRange>[4:4]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR1S</name>																			
				<description>Stop on MR1: the TC and PC will be stopped and TCR[0] will be set to 0 if MR1 matches the TC.</description>																			
				<bitRange>[5:5]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR2I</name>																			
				<description>Interrupt on MR2: an interrupt is generated when MR2 matches the value in the TC.</description>																			
				<bitRange>[6:6]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR2R</name>																			
				<description>Reset on MR2: the TC will be reset if MR2 matches it.</description>																			
				<bitRange>[7:7]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR2S</name>																			
				<description>Stop on MR2: the TC and PC will be stopped and TCR[0] will be set to 0 if MR2 matches the TC.</description>																			
				<bitRange>[8:8]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR3I</name>																			
				<description>Interrupt on MR3: an interrupt is generated when MR3 matches the value in the TC.</description>																			
				<bitRange>[9:9]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR3R</name>																			
				<description>Reset on MR3: the TC will be reset if MR3 matches it.</description>																			
				<bitRange>[10:10]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>MR3S</name>																			
				<description>Stop on MR3: the TC and PC will be stopped and TCR[0] will be set to 0 if MR3 matches the TC.</description>																			
				<bitRange>[11:11]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLED</name>																	
						<description>Enabled</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLED</name>																	
						<description>Disabled</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																			
				<bitRange>[31:12]</bitRange>																			
																						
