cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
						</field>
						<field>
							<name>CLKDIV</name>
							<description>The APB clock (PCLK) is divided by CLKDIV +1 to produce the clock for the ADC, which should be less than or equal to 4.5 MHz. Typically, software should program the smallest value in this field that yields a clock of 4.5 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
							<bitRange>[15:8]</bitRange>

						</field>
						<field>
							<name>BURST</name>
							<description>Burst mode If BURST is set to 1, the ADGINTEN bit in the INTEN register (Table 276) must be set to 0.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SOFTWARE_CONTROLLED_</name>
									<description>Software-controlled mode: Conversions are software-controlled and require 11 clocks.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HARDWARE_SCAN_MODE_</name>
									<description>Hardware scan mode: The AD converter does repeated conversions at the rate selected by the CLKS field, scanning (if necessary) through the pins selected by 1s in the SEL field. The first conversion after the start corresponds to the least-significant bit set to 1 in the SEL field, then the next higher  bits (pins) set to 1 are scanned if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion in progress when this bit is cleared will be completed. Important: START bits must be 000 when BURST = 1 or conversions will not start.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKS</name>
							<description>This field selects the number of clocks used for each conversion in Burst mode, and the number of bits of accuracy of the result in the LS bits of ADDR, between 11 clocks (10 bits) and 4 clocks (3 bits).</description>
							<bitRange>[19:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>11_CLOCKS</name>
									<description>11 clocks / 10 bits</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_CLOCKS</name>
									<description>10 clocks / 9 bits</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS</name>
									<description>9 clocks / 8 bits</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS</name>
									<description>8 clocks / 7 bits</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS</name>
									<description>7 clocks / 6 bits</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS</name>
									<description>6 clocks / 5 bits</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS</name>
									<description>5 clocks / 4 bits</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS</name>
									<description>4 clocks / 3 bits</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[23:20]</bitRange>

						</field>
						<field>
							<name>START</name>
							<description>When the BURST bit is 0, these bits control whether and when an A/D conversion is started:</description>
							<bitRange>[26:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_START_THIS_VALUE</name>
									<description>No start (this value should be used when clearing PDN to 0).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START_CONVERSION_NOW</name>
									<description>Start conversion now.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_2</name>
									<description>Start conversion when the edge selected by bit 27 occurs on PIO0_2/SSEL/CT16B0_CAP0.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_5</name>
									<description>Start conversion when the edge selected by bit 27 occurs on PIO1_5/DIR/CT32B0_CAP0.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT32B0_MAT0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT0[1].</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT32B0_MAT1</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT1[1].</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT16B0_MAT0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT0[1].</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT16B0_MAT1</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT1[1].</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>This bit is significant only when the START field contains 010-111. In these cases:</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RISING</name>
									<description>Start conversion on a rising edge on the selected CAP/MAT signal.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Start conversion on a falling edge on the selected CAP/MAT signal.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:28]</bitRange>

