cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>WDTOSCCTRL</name>				
		<description>Watchdog oscillator control</description>				
		<addressOffset>0x024</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>DIVSEL</name>		
				<description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>		
				<bitRange>[4:0]</bitRange>		

			</field>			
			<field>			
				<name>FREQSEL</name>		
				<description>Select watchdog oscillator analog output frequency (Fclkana).</description>		
				<bitRange>[8:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>0_6_MHZ</name>
						<description>0.6 MHz</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>1_05_MHZ</name>
						<description>1.05 MHz</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>1_4_MHZ</name>
						<description>1.4 MHz</description>
						<value>0x3</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>1_75_MHZ</name>
						<description>1.75 MHz</description>
						<value>0x4</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_1_MHZ</name>
						<description>2.1 MHz</description>
						<value>0x5</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_4_MHZ</name>
						<description>2.4 MHz</description>
						<value>0x6</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_7_MHZ</name>
						<description>2.7 MHz</description>
						<value>0x7</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_0_MHZ</name>
						<description>3.0 MHz</description>
						<value>0x8</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_25_MHZ</name>
						<description>3.25 MHz</description>
						<value>0x9</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_5_MHZ</name>
						<description>3.5 MHz</description>
						<value>0xA</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_75_MHZ</name>
						<description>3.75 MHz</description>
						<value>0xB</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_0_MHZ</name>
						<description>4.0 MHz</description>
						<value>0xC</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_2_MHZ</name>
						<description>4.2 MHz</description>
						<value>0xD</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_4_MHZ</name>
						<description>4.4 MHz</description>
						<value>0xE</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_6_MHZ</name>
						<description>4.6 MHz</description>
						<value>0xF</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:9]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSRSTSTAT</name>				
		<description>System reset status register</description>				
		<addressOffset>0x030</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x3</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>POR</name>		
				<description>POR reset status</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_POR_DETECTED</name>
						<description>No POR detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POR_DETECTED_WRITIN</name>
						<description>POR detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>EXTRST</name>		
				<description>External reset status</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_RESET_EVENT_DETEC</name>
						<description>No reset event detected.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESET_DETECTED_WRIT</name>
						<description>Reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>WDT</name>		
				<description>Status of the Watchdog reset</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_WDT_RESET_DETECTE</name>
						<description>No WDT reset detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>WDT_RESET_DETECTED_</name>
						<description>WDT reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BOD</name>		
				<description>Status of the Brown-out detect reset</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_BOD_RESET_DETECTE</name>
						<description>No BOD reset detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>BOD_RESET_DETECTED_</name>
						<description>BOD reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SYSRST</name>		
				<description>Status of the software system reset</description>		
				<bitRange>[4:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_SYSTEM_RESET_DETE</name>
						<description>No System reset detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>SYSTEM_RESET_DETECTE</name>
						<description>System reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:5]</bitRange>		

