cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>USBCLKUEN</name>				
		<description>USB clock source update enable</description>				
		<addressOffset>0x0C4</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ENA</name>		
				<description>Enable USB clock source update</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>USBCLKDIV</name>				
		<description>USB clock source divider</description>				
		<addressOffset>0x0C8</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x1</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>DIV</name>		
				<description>USB clock divider values 0: Disable USB clock.  1: Divide by 1. to 255: Divide by 255.</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:8]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>CLKOUTSEL</name>				
		<description>CLKOUT clock source select</description>				
		<addressOffset>0x0E0</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SEL</name>		
				<description>CLKOUT clock source</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IRC_OSCILLATOR</name>
						<description>IRC oscillator</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CRYSTAL_OSCILLATOR_</name>
						<description>Crystal oscillator (SYSOSC)</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LF_OSCILLATOR_WATCH</name>
						<description>LF oscillator (watchdog oscillator)</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>MAIN_CLOCK</name>
						<description>Main clock</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>CLKOUTUEN</name>				
		<description>CLKOUT clock source update enable</description>				
		<addressOffset>0x0E4</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ENA</name>		
				<description>Enable CLKOUT clock source update</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		

			</field>			
		</fields>				
	</register>					
	<register>					
		<name>CLKOUTDIV</name>				
		<description>CLKOUT clock divider</description>				
		<addressOffset>0x0E8</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>DIV</name>		
				<description>CLKOUT clock divider values 0: Disable CLKOUT clock divider.  1: Divide by 1. to 255: Divide by 255.</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:8]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PIOPORCAP0</name>				
		<description>POR captured PIO status 0</description>				
		<addressOffset>0x100</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0x00000000</resetMask>				
		<fields>				
			<field>			
				<name>PIOSTAT</name>		
				<description>State of PIO0_23 through PIO0_0 at power-on reset</description>		
				<bitRange>[23:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PIOPORCAP1</name>				
		<description>POR captured PIO status 1</description>				
		<addressOffset>0x104</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0x00000000</resetMask>				
		<fields>				
			<field>			
				<name>PIOSTAT</name>		
				<description>State of PIO1_31 through PIO1_0 at power-on reset</description>		
				<bitRange>[31:0]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>BODCTRL</name>				
		<description>Brown-Out Detect</description>				
		<addressOffset>0x150</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>BODRSTLEV</name>		
				<description>BOD reset level</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>LEVEL_0_THE_RESET_A</name>
						<description>Level 0: The reset assertion threshold voltage is 1.46 V; the reset de-assertion threshold voltage is 1.63 V.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LEVEL_1_THE_RESET_A</name>
						<description>Level 1: The reset assertion threshold voltage is 2.06 V; the reset de-assertion threshold voltage is 2.15 V.</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LEVEL_2_THE_RESET_A</name>
						<description>Level 2: The reset assertion threshold voltage is 2.35 V; the reset de-assertion threshold voltage is 2.43 V.</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LEVEL_3_THE_RESET_A</name>
						<description>Level 3: The reset assertion threshold voltage is 2.63 V; the reset de-assertion threshold voltage is 2.71 V.</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BODINTVAL</name>		
				<description>BOD interrupt level</description>		
				<bitRange>[3:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>LEVEL_0_RESERVED_</name>
						<description>Level 0: Reserved.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LEVEL_1THE_INTERRUP</name>
						<description>Level 1:The interrupt assertion threshold voltage is 2.22 V; the interrupt de-assertion threshold voltage is 2.35 V.</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LEVEL_2_THE_INTERRU</name>
						<description>Level 2: The interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V.</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>LEVEL_3_THE_INTERRU</name>
						<description>Level 3: The interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V.</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BODRSTENA</name>		
				<description>BOD reset enable</description>		
				<bitRange>[4:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLE_RESET_FUNCTI</name>
						<description>Disable reset function.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLE_RESET_FUNCTIO</name>
						<description>Enable reset function.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:5]</bitRange>		

