cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>PORT_ENA%s</name>
					<description>GPIO grouped interrupt port 0/1 enable register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENA_0</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ENA_1</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ENA_2</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ENA_3</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ENA_4</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ENA_5</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ENA_6</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ENA_7</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ENA_8</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ENA_9</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>ENA_10</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>ENA_11</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>ENA_12</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>ENA_13</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>ENA_14</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>ENA_15</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>ENA_16</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>ENA_17</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>ENA_18</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>ENA_19</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>ENA_20</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>ENA_21</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>ENA_22</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>ENA_23</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>ENA_24</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>ENA_25</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>ENA_26</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>ENA_27</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>ENA_28</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>ENA_29</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>ENA_30</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>ENA_31</name>
							<description>Enable port 0/1 pin for group interrupt. Bit n corresponds to pin P0/1_n of port 0/1. 0 = the port 0/1 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0/1 pin is enabled and contributes to the grouped interrupt.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
