cmsis-svd/cmsis-svd/data/NXP/LPC11Uxx.svd
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>SET%s</name>
					<description>Write: Set register for port 0/1  Read: output bits for port 0/1</description>
					<addressOffset>0x2200</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETP0</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SETP1</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SETP2</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SETP3</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SETP4</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SETP5</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SETP6</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SETP7</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SETP8</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SETP9</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SETP10</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>SETP11</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>SETP12</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SETP13</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>SETP14</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>SETP15</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>SETP16</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>SETP17</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>SETP18</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>SETP19</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SETP20</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>SETP21</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>SETP22</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>SETP23</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>SETP24</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SETP25</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>SETP26</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>SETP27</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>SETP28</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>SETP29</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>SETP30</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>SETP31</name>
							<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CLR%s</name>
					<description>Clear port 0/1</description>
					<addressOffset>0x2280</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLRP00</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CLRP01</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CLRP02</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CLRP03</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CLRP04</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CLRP05</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CLRP06</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CLRP07</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CLRP08</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CLRP09</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CLRP010</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CLRP011</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>CLRP012</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>CLRP013</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>CLRP014</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>CLRP015</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>CLRP016</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>CLRP017</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>CLRP018</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>CLRP019</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>CLRP020</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>CLRP021</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>CLRP022</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>CLRP023</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>CLRP024</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>CLRP025</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>CLRP026</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>CLRP027</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>CLRP028</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>CLRP029</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>CLRP030</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>CLRP031</name>
							<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>NOT%s</name>
					<description>Toggle port 0/1</description>
					<addressOffset>0x2300</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>NOTP0</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>NOTP1</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>NOTP2</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>NOTP3</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>NOTP4</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>NOTP5</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>NOTP6</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>NOTP7</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>NOTP8</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>NOTP9</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>NOTP10</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>NOTP11</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>NOTP12</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>NOTP13</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>NOTP14</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>NOTP15</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>NOTP16</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>NOTP17</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>NOTP18</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>NOTP19</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>NOTP20</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>NOTP21</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>NOTP22</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>NOTP23</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>NOTP24</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>NOTP25</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>NOTP26</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>NOTP27</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>NOTP28</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>NOTP29</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>NOTP30</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>NOTP31</name>
							<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
